["  Download the Astro Guide app by VICE on an iOS device to read daily horoscopes personalized for your sun, moon, and rising signs, and learn how to apply cosmic events to self care, your friendships, and relationships. September is such a busy month, and it reaches a crescendo this week with the full moon. Thankfully, Virgo season takes its foot off our necks as two planets, Mercury and Venus, leave Virgo and enter Libra.  Real progress is made as action planet Mars connects with Saturn, the planet of time, on Monday, September 9. There is a fastidious effort to push through roadblocks and address tasks in a way that is sustainable. Slow and steady wins the race. The sun faces off with Neptune, the planet of deception, on Tuesday, September 10—it’s a spiritual vibe. This is because nothing feels very clear, so we’re projecting our own stories into the ether. Since Neptune is involved, manipulation can take place, so stay skeptical.  Impulsive Mars clashes with Jupiter, the planet of abundance, on Thursday, September 12, inspiring us to jump to conclusions, and maybe spread ourselves too thin. This leads up to Mars facing off with deceptive Neptune on Saturday, September 14. Hold yourself back from making the jump right now, and continue doing the prep work instead—things are not totally clear!  If you can sublimate these impulses into something artistic or creative, do that—or, just have a conversation instead of jumping the gun. On Friday, September 13, messenger Mercury meets sweet Venus, making it a perfect time to express affections. Also on Friday, the sun connects with Pluto, the planet of secrets, revealing conspiracies and the dark underbelly of power.  There’s a full moon in Pisces on Saturday, September 14 at 12:33 AM. This moon also gently harmonizes with Pluto, so whatever conversations you have toward the end of the week can be revelatory and revealing!   There is a change of pace as both Mercury, the planet of communication, and Venus, the planet of love and money, enter diplomatic Libra. Spend some time early in the week getting your most important corresponding and compartmentalizing done while Mercury is still in Virgo. Once it enters Libra, we save precision for social politics. Venus, the planet of beauty and justice is at home in Libra, the sign of relationships and commerce.  All times ET.   Virgo (August 23 - September 22) You’re wrapping up on some big personal projects, Virgo. Your planetary ruler, fastidious Mercury, the planet of communication, spends its final moments in your sign before moving over on Saturday. Figure out the most sustainable and productive use of your energy. As action planet Mars harmonizes with taskmaster Saturn, this can look like literally doing what you love—apply yourself in the ways that feel good. And don’t let other people tell you what makes you feel good. Neptune’s influence can put some pressure on you to be a martyr. The full moon in Pisces on Saturday is a revelatory time for you to figure out what kinds of relationships are healthy for you, and which ones feel like an invasion of personal space.   Libra (September 22 - October 23) Finally all of the work you’ve been doing behind the scenes—dedicating yourself to your health and volunteering to help others—comes to fruition during Saturday’s Pisces full moon. Here you can see your progress: what’s improved and what areas of your health require more work and focus. If the lunar cycle were an art school, the full moon would be your critique, when you take a step back and learn what you can do better next time. This is especially true during critical Virgo season, but you know better than any other sign that sometimes it’s not up to you. That’s not to say you should be a pushover. Your planetary ruler Venus moves into your sign, Libra, on Saturday, putting you in your beautiful and self-indulgent element.   Scorpio (October 23 - November 22) Whatever new connections were made during the Virgo new moon are answered, bearing some fruit during Saturday’s full moon in Pisces. There is pleasure in your friendships, and maybe even some cute dates, too. It’s a great week to enjoy social connections. Your planetary ruler Mars harmonizes with Saturn, the planet of time, and later faces off with deceptive Neptune. If you’re in charge, you can find ways to divide your work among a network or community, or maybe crowdsource for assistance. There is a way to achieve max productivity, but not everyone wants to do your bidding. Neptune’s involvement can encourage you to breach boundaries. Ask if it’s OK to ask for something before you ask for it. Someone out there can help.   Sagittarius (November 21 - December 21) You’re punching up, Sagittarius! Action planet Mars clashes with your planetary ruler Jupiter, the planet of growth, and there is something impulsive and over-the-top happening here—a quick and fastidious leap toward something that can make you look good. The planet of deception, shapeshifting Neptune, is involved, inspiring some mastermind PR stunts. Be honest with yourself about the person you want to be remembered as—consider how it is authentic to your beliefs and your roots. This is a productive thing to contemplate during Saturday’s Pisces full moon, which illuminates a very private and personal sector of your chart, encouraging you to get in touch with your ancestors and home life in general.   Capricorn (December 21 - January 19) You are a sign that knows how to get other people to do everything for you, Capricorn, a natural boss. Action planet Mars harmonizes with taskmaster Saturn (your planetary ruler), clashes with expansive Jupiter, and faces off with deceptive Neptune—phew! Your worldview and beliefs are influencing how you’re making progress, and also how you hold yourself back. Sometimes less is more, and it’s good that you’re so grounded, but Neptune’s involvement signals some sort of misinformation and sense of misguidedness. Don’t believe everything that you read. There are things lurking in the shadows that aren’t completely revealed just yet, and you can get a sense of their shape even if you don’t know their name. The full moon illuminates your own bias.   Aquarius (January 19 - February 18) You’re hitting a productive streak as action planet Mars harmonizes with taskmaster Saturn, your planetary ruler. You can make strides in things that aren’t the easiest to address—such strength! Financial insecurity is on the docket as the sun faces off with confusing Neptune, so be honest with yourself about your budget. Your own qualms about money is no reason to pick pointless fights online. Action planet Mars clashes with Jupiter and you can be feeling feisty and frankly too big for your birches. This weekend’s full moon illuminates a financial sector of your chart and you can pay off some debts, but you might not really feel like it. Listen to your gut when it comes to big purchases.   Pisces (February 18 - March 20) Turn your dreams into a reality, if you can do it without getting distracted, Pisces! You need a few people to make it happen—some doers, thinkers, and cheerleaders, too. Action planet Mars connects with taskmaster Saturn and there is an air of perseverance and strength, but Mars and the sun face off with dreamy Neptune, and people may see and act on things that aren’t really there. Since Neptune is in your sign, you may be reflecting on what other people value and want, and in turn shape yourself to fit into their box. This weekend’s full moon can help you release other people’s stories and journeys from your own ether. Bring it all back to you.   Aries (March 20 - April 19) You’re a sign that stereotypically does everything quickly and impulsively, but you need to slow down, Aries. Your planetary ruler Mars faces off with deceptive Neptune this week, so avoid acting out things that are simply projections of your own imagination! Mars also harmonizes with Saturn, the planet of time that’s also associated with fear and stress. You may be pushing yourself out of something that was founded on impossibly high standards. Mars also clashes with Jupiter, the planet of expansion, giving you a lot of energy to make things happen, but be careful not to rub people the wrong way—Jupiter has a tendency to over-exaggerate and things can quickly get out of hand. Again, pace yourself. Spend some time alone in meditation during this weekend’s full moon in Pisces.   Taurus (April 19 - May 20) Your planetary ruler Venus moves into fellow Venus-ruled sign Libra this weekend, bringing pleasure and harmony to your daily routine. Your approach to your physical health and relationships with the people you work with can be more appealing to you now. You’re working out what makes you happy and what can be trimmed, and you put this into action as Mars harmonizes with Saturn. You have really high standards, Taurus, and we love it! Get lost in some art and movies while your friends are feeling very sensitive—the sun faces off with Neptune and people are really taking things personally. Messenger Mercury meets your planetary ruler Venus, and things are romantic and creative. Go deep into what brings you pleasure, so that you can share it with others this weekend.   Gemini (May 20 - June 21) You have a lot of strength and dedication to transforming your personal life as Mars harmonizes with Saturn, encouraging you to face tough changes responsibly and head-on. It’s hard to know which way to go when it comes to how you want to be known, and things aren’t so clear as the sun faces off with Neptune, the planet of deception. Just ride. You can feel agitated and compelled toward someone else’s path as Mars clashes with Jupiter, but keep your cool—arguments may get out of hand. Mercury meets Venus, bringing sweetness to your doorstep. The full moon lights up your house of career, but its gentle connection with shady Pluto points to potentially secretive or manipulative people! Protect yourself.   Cancer (June 21 - July 22) There’s a lot going on, but at least you have some responsible people in your life that can help you hold it down. Mars connects with taskmaster Saturn, helping you collaborate with others to get your shit done. Foggy Neptune is stirring the pot now, making it harder to see what direction you’re heading, and what you believe. It’s a lost vibe. Picking fights with others won’t help—Mars clashes with philosophical Jupiter and a debate can get out of hand. Use this active energy to get organized and attack your to-do list instead. Talking and getting to know your acquaintances better is more fun and pleasurable as Mercury meets Venus. This weekend the emotional full moon, in combination with Venus and Mercury entering Libra, pulls you back into your shell.   Leo (July 22 - August 23) You’re getting so much done—and money is your motivation! Mars connects with taskmaster Saturn, encouraging you to work and spend responsibly. You have authority over the work that you do. You might feel some FOMO with all of these planets lining up with Neptune, the planet of confusion. Other people seem to have it all, but it’s an illusion. Don’t feel compelled to keep up with the Kardashians or buy things just because other people have them, Leo. Mars clashes with Jupiter, and you can do some impulse spending on things that bring you pleasure, but the assumption that others will be impressed is not any reason to go into debt. This weekend’s full moon provides an opportunity for transformative release. Let go of whatever materialistic bologna is fogging up your brain.   What's in the stars for you in September?  Read your monthly horoscope here.   Want these horoscopes sent straight to your inbox?  Click here to sign up for the newsletter.","Download the Astro Guide app by VICE on an iOS device to read daily horoscopes personalized for your sun, moon, and rising signs, and learn how to apply cosmic events to self care, your friendships, and relationships.    Action planet Mars connects with taskmaster Saturn at 12:13 AM, creating a focused energy—we know our limits and are working our strengths! The moon in Capricorn connects with Venus at 4:30 AM, inspiring a sensual atmosphere. The moon enters cool air sign Aquarius at 5:24 PM, encouraging us to take a detached look at our emotions. All times ET.             Virgo (August 23 - September 22) Fiery Mars connects with taskmaster Saturn today, helping you finish something you weren't excited to begin. A productive energy flows, and you're glad that tasks are being completed. The moon enters Aquarius, inspiring you to reorganize your workspace.             Libra (September 22 - October 23) Warrior planet Mars connects with taskmaster Saturn, encouraging you to express your boundaries, and set limits and standards. You're also in a flirtatious mood and eager to have fun today as the moon enters fellow air sign Aquarius!             Scorpio (October 23 - November 22) Your ruling planet Mars connects with taskmaster Saturn today, helping you have a difficult conversation. The moon enters Aquarius, encouraging you to focus on your home and family life—make time to energetically cleanse your home!             Sagittarius (November 21 - December 21) Action planet Mars connects with taskmaster Saturn, creating a productive atmosphere at work. It's a powerful day to rework your budget and set goals. The moon enters Aquarius, creating a talkative atmosphere and bringing news your way.             Capricorn (December 21 - January 19) Action planet Mars connects with your ruling planet Saturn, helping you lay the framework for a big plan that will get your ideas out into the world. The moon enters Aquarius, asking you to reflect on your budget.             Aquarius (January 19 - February 18) Warrior planet Mars connects with your ruling planet Saturn, creating a supportive energy as you work though issues that have been weighing you down. The moon enters your sign, Aquarius, encouraging you to focus on self love: Get some fresh air, vent to a friend, take a break from your usual routine, and do something new.             Pisces (February 18 - March 20) Action planet Mars connects with the planet of time, Saturn, today, creating a supportive atmosphere as you and your partners work out commitments and plans for the future. The moon enters Aquarius, boosting your intuitive abilities.             Aries (March 20 - April 19)  Your ruling planet Mars makes a solid connection with Saturn today, finding you stepping into a place of power and strength in your career. Your patience is paying off. The moon enters Aquarius, encouraging you to network and connect with friends.             Taurus (April 19 - May 20) Action planet Mars connects with the planet of responsibility, Saturn, and you're stepping into a leadership role with strength and confidence. The moon enters Aquarius, inspiring you to reflect on your career goals.             Gemini (May 20 - June 21) You're feeling strong, slaying emotional hurdles as warrior planet Mars connects with supportive Saturn. The moon enters fellow air sign Aquarius, encouraging you to take a trip—you're in the mood to enjoy new surroundings.             Cancer (June 21 - July 22) Warrior planet Mars harmonizes with taskmaster Saturn, inspiring a productive energy in your relationships! The moon enters Aquarius, encouraging you to confront your fears. Intimacy is a big theme for you lately: How do you feel about where you're at with yourself and others?             Leo (July 22 - August 23) Action planet Mars makes a helpful connection with the planet of responsibility, Saturn, creating a supportive energy in your career and day job. The moon enters Aquarius, lighting up the relationship sector of your chart and inspiring you to connect with people.  What's in the stars for you in September? Read your monthly horoscope here.  Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. ","Download the Astro Guide app by VICE on an iOS device to read daily horoscopes personalized for your sun, moon, and rising signs, and learn how to apply cosmic events to self care, your friendships, and relationships.    Confusion and miscommunications abound as messenger planet Mercury opposes hazy Neptune at 3:19 AM. The moon enters grounded earth sign Capricorn at 6:37 AM, and the moon connects with brilliant Uranus at 6:47 PM, inspiring an inventive atmosphere. All times ET.             Virgo (August 23 - September 22) Confusing conversations take place today—especially in your relationships—as your ruling planet Mercury opposes hazy Neptune. You have something important to say, but you're not feeling heard. The moon enters fellow earth sign Capricorn and connects with electric Uranus, bringing surprises and a sense of freedom.             Libra (September 22 - October 23) It's a marvelous day to develop your psychic intuition and engage in dream work, but don't let your imagination run away from you or get overwhelmed by paranoia as Mercury opposes Neptune. The moon enters grounded Capricorn and connects with Uranus, inspiring emotional transformation—you're ready to level up.             Scorpio (October 23 - November 22) It's a frustrating day in your social life and communications as messenger Mercury opposes hazy Neptune. The moon enters Capricorn, helping you get more grounded, and harmonizes with Uranus, bringing surprising connections your way.             Sagittarius (November 21 - December 21) Communication planet Mercury opposes dreamy Neptune, creating an imaginative atmosphere that could unfortunately easily veer into paranoia. The line between your personal and public life is blurry. The moon enters Capricorn and connects with Uranus, helping you get grounded when it comes to making changes in your schedule.             Capricorn (December 21 - January 19) It's a difficult day for communication as messenger Mercury opposes dreamy Neptune. Save important conversations for another time because things aren't making sense right now! The moon enters your sign, Capricorn, and connects with Uranus, bringing an unexpected burst of romance and creativity.             Aquarius (January 19 - February 18) Communication planet Mercury opposes hazy Neptune, so watch out for misunderstandings, especially concerning money. The moon enters Capricorn and connects with Uranus, encouraging you to trust your intuition—an amazing emotional breakthrough takes place!             Pisces (February 18 - March 20) Communication planet Mercury opposes your ruling planet Neptune, creating a confusing energy for communication, especially in your relationships! Save an important conversation for another day. The moon enters Capricorn, creating a more grounding energy, and connects with Uranus, bringing surprising news.             Aries (March 20 - April 19)  Communication planet Mercury opposes sleepy Neptune, and not much is making sense. Your schedule is a mess, and communication is tough. The moon enters Capricorn and connects with Uranus, bringing surprises about money and shifting your focus to your career.             Taurus (April 19 - May 20) Messenger planet Mercury opposes hazy Neptune, creating confusion in your social life, but things feel more settled when the moon enters fellow earth sign Capricorn, inspiring you to explore new opportunities, especially as it connects with risk-taking Uranus.             Gemini (May 20 - June 21) Your ruling planet Mercury opposes dreamy Neptune today, creating a confusing energy. You're feeling nostalgic and not sure where you want to head in the future. The moon enters Capricorn, inspiring you to face your fears, and connects with Uranus, bringing a burst of intuitive insight.             Cancer (June 21 - July 22) Messenger planet Mercury opposes hazy Neptune, creating a difficult energy for communication—nothing is making sense! Your focus turns to your relationships as the moon enters Capricorn, and surprising meetings take place as it connects with Uranus.             Leo (July 22 - August 23) Communication planet Mercury opposes hazy Neptune, creating a confusing energy, especially when it comes to finances. Thankfully, the moon enters grounded earth sign Capricorn, helping you out at work, and connects with electric Uranus, helping you break through some scheduling issues.  What's in the stars for you in September? Read your monthly horoscope here.  Want these horoscopes sent straight to your inbox?   Click here to sign up for the newsletter. "]